Revit 2027 API
OverrideGraphicSettings.CutLineWeight Property
 Cut surface line weight.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int CutLineWeight { get; }
Public ReadOnly Property CutLineWeight As Integer
	Get
public:
property int CutLineWeight {
	int get ();
}
member CutLineWeight : int with get
Property Value
Int32
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace